{
  "attention_probs_dropout_prob": 0.1,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 256,
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "num_attention_heads": 4,
  "num_hidden_layers": 4,
  "pooler_fc_size": 256,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "type_vocab_size": 2,
  "vocab_size": 21128,
  "base_model_prefix": "encoder",
  "model_type": "bert",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "id2label": {
    "0": "negative",
    "1": "positive"
  },
  "label2id": {
    "negative": 0,
    "positive": 1
  },
  "num_labels": 2
}